// подключение библиотеки fs и асинхронно прочитали файд data.txt
const fs = require("fs");

// rfFirstCallback это когда мы передаем колбек, который ввызовется когда файловая система прочитает этот файл и получит его содержимое и она вызовет колбек
// gервый параметр всегда ошибка, а второй наши данные
fs.readFile("./data.txt", "utf-8", (error, data) => {
  if (error) {
    console.error(error);
  }
  console.log("data :>> ", data);
});

// синхронная операция - выполнится первой
console.log(111111111);

//node fs  в терминале
